# мини словарь
dict = {
    cat: ['кошка', 'кот', 'киса'],
    dog: ['собака', 'пес', 'пёс'],
    girl: ['девочка', 'девушка']
}

loop do
  input = gets.strip.downcase

  # англо-русский перевод
  if dict[input.to_sym]                         # если введенный ключ присутствует
    puts dict[input.to_sym].join(', ')  # вывести варианты перевода
  else

  # русско-английский перевод
    dict.each_value do |v|                      # иначе перебрать значения хеша
      # тернарым оператором вывести перевод, а если нет слова, оповестить и заново
      v.any?(input) ? puts(dict.key(v)) : puts("Нет в словаре"); break
    end
  end
end

